app/views/users/show.html.erb


<%@user.playlists.each do |playlist|%>
<h3 class="rainbow">Playlist "<%=link_to "#{playlist.name}",playlist_path(playlist)%>"</h3>
<%= image_tag("#{playlist.songs.last.album_url}",  alt: "like", class: "like_image_for_index") %>
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ?  [["user_id", 1]]
SELECT  "songs".* FROM "songs" INNER JOIN "playlistsongs" ON "songs"."id" = "playlistsongs"."song_id" WHERE "playlistsongs"."playlist_id" = ? ORDER BY "songs"."id" DESC LIMIT ?  [["playlist_id", 1], ["LIMIT", 1]]