app/views/users/show.html.erb

<%if @user.playlists.length >0 %>
<%@user.playlists.each do |playlist|%>
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ?  [["user_id", 4]]


<% if playlist.songs.length > 0 %>
---
SELECT "songs".* FROM "songs" INNER JOIN "playlistsongs" ON "songs"."id" = "playlistsongs"."song_id" WHERE "playlistsongs"."playlist_id" = ?  [["playlist_id", 4]]