app/controllers/playlistsongs_controller.rb

    def create
        @playlist = Playlist.find(params[:id])
        @song = Song.search(params[:search])
        if @song[0]
            Playlistsong.create(playlist_id: @playlist.id, song_id: @song[0].id)
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "songs" ("name", "artist", "created_at", "updated_at", "album_url", "album", "spotify_id") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "playlistsongs" ("playlist_id", "song_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["playlist_id", 2], ["song_id", 2], ["created_at", "2019-05-29 13:51:41.433569"], ["updated_at", "2019-05-29 13:51:41.433569"]]

    def delete

        @playlistsong = Playlistsong.find(params[:id])
        @playlist = @playlistsong.playlist
        @playlistsong.delete
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "playlistsongs".* FROM "playlistsongs" WHERE "playlistsongs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "playlistsongs" WHERE "playlistsongs"."id" = ?  [["id", 10]]