app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
---
    def index
        @playlists = Playlist.all

SELECT "users".* FROM "users"
---
    def new
        @playlist = Playlist.new
        @users = User.all

INSERT INTO "playlists" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Home"], ["created_at", "2019-05-28 20:54:44.841097"], ["updated_at", "2019-05-28 20:54:44.841097"], ["user_id", 1]]
---
    def create
        @playlist = Playlist.create(playlist_params)

SELECT "users".* FROM "users"
---
    def edit
        @playlist = find_playlist
        @users = User.all

UPDATE "playlists" SET "name" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["name", "Home Again"], ["updated_at", "2019-05-29 13:05:09.115427"], ["id", 1]]
---
    def update
        @playlist = find_playlist
        @playlist.update(playlist_params)

DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 1]]
---
    def destroy
        @playlist = find_playlist
        @playlist.destroy

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_playlist
        Playlist.find(params[:id])