app/controllers/playlists_controller.rb

    def add_song

        @playlist = find_playlist
        @song = Song.search(params[:search])
        if @song[0]
            Playlistsong.create(playlist_id: @playlist.id, song_id: @song[0].id)
---
INSERT INTO "songs" ("name", "artist", "created_at", "updated_at", "album_url", "album") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "playlistsongs" ("playlist_id", "song_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["playlist_id", 1], ["song_id", 3], ["created_at", "2019-05-28 21:39:30.875057"], ["updated_at", "2019-05-28 21:39:30.875057"]]

    def find_playlist
        Playlist.find(params[:id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]