app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        if params[:search]
            @songs = Song.search(params[:search])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_song
        Song.find(params[:id])