app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)
---
    def create
        @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "y.hartung"], ["updated_at", "2019-05-30 15:06:38.000847"], ["id", 4]]
---
    def update
        @user = User.find(params[:id])

        @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 4], ["followee_id", 1], ["created_at", "2019-05-29 21:52:37.583780"], ["updated_at", "2019-05-29 21:52:37.583780"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def follow
        @user = User.find(params[:id])

        User.find_by(user_params).followers << @user

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
    def destroy
        @user = find_user
        @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def find_user
        User.find(params[:id])