app/models/song.rb

    def self.search(search)
            song = RSpotify::Track.search(search).first

            if song
               song_result =[]
               song_result << Song.find_or_create_by(spotify_id: song.id, name: song.name, artist: song.artists.first.name, album_url: song.album.images[1]["url"], album: song.album.name)
---
INSERT INTO "songs" ("name", "artist", "created_at", "updated_at", "album_url", "album", "spotify_id") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "songs".* FROM "songs" WHERE "songs"."name" = ? AND "songs"."artist" = ? AND "songs"."album_url" = ? AND "songs"."album" = ? LIMIT ?  [["name", "Crazy In Love (feat. Jay-Z)"], ["artist", "Beyoncé"], ["album_url", "https://i.scdn.co/image/58ce427aaf12cf21f56be209216b0fb2ac0550f3"], ["album", "Dangerously In Love"], ["LIMIT", 1]]