app/models/user.rb

SELECT "users".* FROM "users"
---
   def not_following
        @following = self.followees
        @users = User.all