app/views/playlists/show.html.erb

  <li><%= link_to "#{song.name} - #{song.artist}", song %></li>
  <%=button_to "Remove Song from Playlist", "/playlistsongs/#{Playlistsong.find_by(playlist_id: @playlist.id, song_id: song.id).id}", method: :delete %>
---
SELECT  "playlistsongs".* FROM "playlistsongs" WHERE "playlistsongs"."playlist_id" = ? AND "playlistsongs"."song_id" = ? LIMIT ?  [["playlist_id", 2], ["song_id", 7], ["LIMIT", 1]]