app/views/application/index.html.erb

<%@friends.each do |friend|%>
<%=link_to "#{friend.playlists.last.name} by #{friend.username}",playlist_path(friend.playlists.last)%> <br>
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ? ORDER BY "playlists"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

<h3 class="rainbow">Check out what other users have been listening to lately: </h3>
<%Song.all.each do |song|%>
---
SELECT "songs".* FROM "songs"